Documents/Р_УстановкаСкидокНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Р_УстановкаСкидокНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВремяДействияСкидок</xr:Item>
				<xr:Item>InformationRegister.СпецПредложения</xr:Item>
				<xr:Item>InformationRegister.СкидкиНоменклатурыНатуральные</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиПоЦеновымГруппам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкаСкидокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсейНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехПолучателей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАкция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДнямНедели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НомерАкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничениеСкидкиНаценки</Name>
							<Comment>(Общ) Ограничение скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВремяПоДнямНедели</Name>
					<Comment>(Общ) Время действия скидки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>(Общ) Признак выбранного дня недели</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>(Общ) День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ) Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ) Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничениеСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецПредложение</Name>
							<Comment>Комплект номенклатуры и бонусов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаСпецПредложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Р_КоличествоСпецПредложение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Р_РазличныеТоварыИзГруппы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Р_ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийУстановкаСкидокНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУстановкаСкидокНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦеновымГруппам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НатуральныеСкидки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розничная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптовая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Р_УстановкаСкидокНоменклатуры/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
Перем Валюта;
Перем ВидСкидки;
Перем Условие;

&НаСервере
Процедура ИзменитьСоставНабораНаСервере(ПараметрыРасчета)
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ОбъектДокумента.СоставНабора.Загрузить(ПараметрыРасчета.СоставНабора);
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоставБонусовОткрытие(Команда)
	//СтандартнаяОбработка = Ложь;
	Если Объект.КоличествоБонусов = 0 Тогда
		Сообщить("Укажите количество бонусов");
		Возврат;
	КонецЕсли;

	//СтрокаТабличнойЧасти = Элементы.Бонусы.ТекущиеДанные;

	СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	//СтруктураПараметров.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
	СтруктураПараметров.Вставить("Количество", Объект.КоличествоБонусов);

	//СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("ДокументОбъект", Объект);
	////СтруктураПараметров.Вставить("ФормаДокумента", ЭтаФорма);
	СтруктураПараметров.Вставить("ИмяТабличнойЧасти", "Бонусы");
	//СтруктураПараметров.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки -1);
	СтруктураПараметров.Вставить("КлючСтроки", 2);

	СтруктураПараметров.Вставить("ЗаголовокФормы", "Укажите состав бонусов");

	                             
	ПараметрыРасчета = ОткрытьФормуМодально("Документ.УстановкаСкидокНоменклатуры.Форма.ФормаУпр", Новый Структура("СтруктураИсходныхПараметров", СтруктураПараметров), ЭтаФорма);
	
	Если ПараметрыРасчета <> Неопределено Тогда
		ОчиститьСообщения();
		ИзменитьСоставНабораНаСервере(ПараметрыРасчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставАкцииОткрытие(Команда)
	//СтандартнаяОбработка = Ложь;
	
	//СтрокаТабличнойЧасти = Элементы.Бонусы.ТекущиеДанные;

	Если Объект.КоличествоАкция = 0 Тогда
		Сообщить("Укажите количество акции");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураПараметров.Вставить("Количество", Объект.КоличествоАкция);
	//СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("ДокументОбъект", Объект);
	////СтруктураПараметров.Вставить("ФормаДокумента", ЭтаФорма);
	СтруктураПараметров.Вставить("ИмяТабличнойЧасти", "Бонусы");
	//СтруктураПараметров.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки -1);
	СтруктураПараметров.Вставить("КлючСтроки", 1);

	СтруктураПараметров.Вставить("ЗаголовокФормы", "Укажите состав комплекта, на который дается бонус");

	                             
	ПараметрыРасчета = ОткрытьФормуМодально("Документ.УстановкаСкидокНоменклатуры.Форма.ФормаУпр", Новый Структура("СтруктураИсходныхПараметров", СтруктураПараметров), ЭтаФорма);
	
	Если ПараметрыРасчета <> Неопределено Тогда
		ОчиститьСообщения();
		ИзменитьСоставНабораНаСервере(ПараметрыРасчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ

		//Если НЕ ЗначениеЗаполнено(ПараметрОснование) И ПараметрОбъектКопирования = Неопределено Тогда
			//Элементы.Валюта = Валюта;
			//Элементы.ВидСкидки = ВидыСкидки;
			//Элементы.Условие = Условие;
		//КонецЕсли;

		ИзменитьТипЗначенияУсловия();
		//Объект.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоНоменклатуре;
	КонецЕсли;

	СтруктураКолонок = Новый Структура();

	// Установить колонки, видимостью которых пользователь управлять не может.
	СтруктураКолонок.Вставить("Номенклатура");

	// Установить ограничение - изменять видимоть колонок для таличного поля 
	// "ТаблицаСкидокНаценок".
	//ОбработкаТабличныхЧастей.УстановитьИзменятьВидимостьКолонокТабЧасти(мКолонкиТовары, СтруктураКолонок);

	// Запомнить текущие значения реквизитов формы.
	//мТекущаяДатаДокумента = Дата;

	// Установить видимость колонок "ХарактеристикаНоменклатуры".
	Элементы.СоставНабора.Видимость = Ложь;
	
	УстановитьВидимость();

	// Установка текущей страницы
	Страницы = Новый СписокЗначений;
	Страницы.Добавить("Товары",              "Товары");
	Страницы.Добавить("ЦеновыеГруппы",       "ЦеновыеГруппы");
	Страницы.Добавить("Бонусы",              "Бонусы");
	Страницы.Добавить("ПолучателиСкидки",    "ПолучателиСкидки");
	//РаботаСДиалогами.УстановкаТекущейСтраницы(ЭтотОбъект, ЭлементыФормы.ОсновнаяПанель, Страницы,);

	//// Установить активный реквизит.
	//РаботаСДиалогами.АктивизироватьРеквизитВФорме(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры

Процедура УстановитьВидимость()

	ВидОперацииНеБонусы = (Объект.ВидОперации <> Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.НатуральныеСкидки);
	ВидОперацииНоменклатура = (Объект.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоНоменклатуре);

	Элементы.Товары.Видимость = ВидОперацииНоменклатура И Не Объект.ДляВсейНоменклатуры;
	Элементы.ЦеновыеГруппы.Видимость = (Объект.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоЦеновымГруппам);
	Элементы.ГруппаБонусы.Видимость = Не ВидОперацииНеБонусы;
	Элементы.ГруппаВремяПоДнямНедели.Видимость = Объект.ПоДнямНедели;

	Если ВидОперацииНоменклатура И Объект.ДляВсейНоменклатуры И Не Объект.ПоДнямНедели Тогда
		Элементы.Страницы.Видимость = Ложь;
	Иначе
		Элементы.Страницы.Видимость = Истина;
	КонецЕсли;

	Элементы.ДляВсейНоменклатуры.Видимость = ВидОперацииНоменклатура;

	Если ВидОперацииНоменклатура И Объект.ДляВсейНоменклатуры Тогда
		Элементы.Качество.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Качество.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Качество.ОтметкаНезаполненного = Ложь;
	КонецЕсли;

	Элементы.Валюта.Видимость                 = ВидОперацииНеБонусы;
	//Элементы.НадписьВалюта.Видимость          = ВидОперацииНеБонусы;

	//Элементы.ТипСкидкиНаценки.Видимость       = ВидОперацииНеБонусы;
	//Элементы.НадписьТипСкидки.Видимость       = ВидОперацииНеБонусы;

	Элементы.Условие.Видимость                = ВидОперацииНеБонусы;
	//Элементы.НадписьУсловие.Видимость         = ВидОперацииНеБонусы;

	Элементы.ПроцентСкидкиНаценки.Видимость   = ВидОперацииНеБонусы;
	//Элементы.НадписьПроцент.Видимость         = ВидОперацииНеБонусы;

	Элементы.ОграничениеСкидкиНаценки.Видимость      = ВидОперацииНеБонусы;
	//Элементы.НадписьОграничение.Видимость     = ВидОперацииНеБонусы;

	Элементы.Качество.Видимость               = ВидОперацииНеБонусы;
	//Элементы.НадписьКачество.Видимость        = ВидОперацииНеБонусы;

	Если Не ВидОперацииНеБонусы Тогда
		Элементы.Валюта.АвтоВыборНезаполненного = Ложь;
		Элементы.Валюта.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.Валюта.АвтоВыборНезаполненного = Истина;
		Если НЕ ЗначениеЗаполнено(Валюта) Тогда
			Элементы.Валюта.ОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий Или Не ВидОперацииНеБонусы Тогда
		Элементы.ЗначениеУсловия.Видимость = Ложь;
		//Элементы.НадписьЗначениеУсловия.Видимость = Ложь;
	Иначе
		Элементы.ЗначениеУсловия.Видимость = Истина;
		//Элементы.НадписьЗначениеУсловия.Видимость = Истина;
	КонецЕсли;

	СтрВалюта = ?(НЕ ЗначениеЗаполнено(Валюта), "<>", Валюта);

	//мКолонкиТовары.ОграничениеСкидкиНаценки.ТекстШапки = "Огр. (" + СтрВалюта + ")";

	//Если Элементы.Условие = Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента Тогда
	//	Элементы.НадписьЗначениеУсловия.Заголовок= "Значение условия (" + СтрВалюта + "):";
	//Иначе
	//	Элементы.НадписьЗначениеУсловия.Заголовок= "Значение условия:";
	//КонецЕсли;

	//Элементы.НадписьОграничение.Заголовок= "Ограничение (" + СтрВалюта + "):";

	//мКолонкиЦеновыеГруппы.ОграничениеСкидкиНаценки.ТекстШапки = "Огр. (" + СтрВалюта + ")";

	Если (Объект.Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте
	 Или Объект.Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт) Тогда
	   //И мУчетнаяПолитика.ИспользоватьСкидкиПоДисконтнойКарте
	   //И мУчетнаяПолитика.ИспользоватьНакопительныеСкидкиПоДисконтнымКартам
	   //И Элементы.ДляВсейНоменклатуры
	   //И мУчетнаяПолитика.СпособИспользованияНакопительныхСкидок = Перечисления.СпособыИспользованияНакопительныхСкидок.СкидкиНакапливаютсяПоДисконтнойКарте Тогда
		//мКолонкиТовары.ПроцентСкидкиНаценки.ТолькоПросмотр = Истина;
		//мКолонкиЦеновыеГруппы.ПроцентСкидкиНаценки.ТолькоПросмотр = Истина;
		Элементы.ПроцентСкидкиНаценки.ТолькоПросмотр = Истина;
	Иначе
		//мКолонкиТовары.ПроцентСкидкиНаценки.ТолькоПросмотр = Ложь;
		//мКолонкиЦеновыеГруппы.ПроцентСкидкиНаценки.ТолькоПросмотр = Ложь;
		Элементы.ПроцентСкидкиНаценки.ТолькоПросмотр = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимость()

Процедура ИзменитьТипЗначенияУсловия()

	Если Объект.Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте Тогда
		Объект.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИнформационныеКарты");
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт Тогда
		Объект.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыДисконтныхКарт");
	Иначе
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	КонецЕсли;

	ЗначениеУсловия = Элементы.ЗначениеУсловия.ОграничениеТипа.ПривестиЗначение(ЗначениеУсловия);

	Если Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий Тогда
		Объект.ЗначениеУсловия = 0;
	КонецЕсли;

КонецПроцедуры // ИзменитьТипЗначенияУсловия()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ

		//Если НЕ ЗначениеЗаполнено(ПараметрОснование) И ПараметрОбъектКопирования = Неопределено Тогда
			Этаформа.Объект.Валюта = Константы.ВалютаУчета.Получить();
			Этаформа.Объект.ВидСкидки = Перечисления.ВидыСкидок.Розничная;
			Этаформа.Объект.Условие = Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента;
			Этаформа.Объект.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоНоменклатуре;
		//КонецЕсли;

		//ИзменитьТипЗначенияУсловия();

	КонецЕсли;


КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	Объект.Товары.Очистить();
	Объект.Бонусы.Очистить();
	Объект.СоставНабора.Очистить();
	Объект.ЦеновыеГруппы.Очистить();
	Объект.КоличествоАкция = 0;
	Объект.КоличествоБонусов = 0;
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоНоменклатуре Тогда
	//	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ЭлементыФормы.ОсновнаяПанель.Страницы["Товары"];
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоЦеновымГруппам Тогда
	//	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ЭлементыФормы.ОсновнаяПанель.Страницы["ЦеновыеГруппы"];
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.НатуральныеСкидки Тогда
	//	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ЭлементыФормы.ОсновнаяПанель.Страницы["Бонусы"];
	//КонецЕсли;


	//
	//
	//Элементы.Товары.Видимость = ВидОперацииНоменклатура И Не Объект.ДляВсейНоменклатуры;
	//Элементы.ЦеновыеГруппы.Видимость = (Элементы.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоЦеновымГруппам);
	//Элементы.ГруппаБонусы.Видимость = Не ВидОперацииНеБонусы;
	//Элементы.ВремяПоДнямНедели.Видимость = Элементы.ПоДнямНедели;

КонецПроцедуры


&НаКлиенте
Процедура ДляВсейНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимость();

КонецПроцедуры


&НаКлиенте
Процедура ПоДнямНеделиПриИзменении(Элемент)
	
	УстановитьВидимость();

	Если Объект.ПоДнямНедели Тогда //Элемент.Значение Тогда
		Если Объект.ВремяПоДнямНедели.Количество() = 0 Тогда
			//ЗаполнитьПоДнямНедели(Объект.ВремяПоДнямНедели);

			Объект.ОбщееВремяНачала = '00010101000000';
			Объект.ОбщееВремяОкончания = '00010101235959';
		КонецЕсли;
	КонецЕсли;


КонецПроцедуры
